{"Name":"Vishal Verma","Title":"Cloud Architect","Email":"v2verma1990@gmail.com","Phone":"+917259577668 / +447880665787","Location":"London, United Kingdom","LinkedIn":"","Website":"","Summary":"Experienced Architect with over 14+ years of expertise in cloud architecture, specializing in Microsoft Azure services and solutions. Skilled in assessing and recommending public and hybrid Cloud solutions (IaaS, SaaS, PaaS) and advising customers on Cloud solution options. Adept at collaborating with cross-functional teams to define cloud strategies, roadmaps, and migration plans. Proven track record of architecture and implementing cloud-native solutions, microservices, serverless architectures, and containerized applications. Committed to continuous professional growth and driving innovation. Highly experienced in server/application migration to Azure Cloud.","Skills":["Architectural Design","DevOps","Cloud Migration","Project Plan","C# / .Net","Cloud Architecture","Urban Code/Bamboo/Octopus","Cloud Strategy and Roadmapping","Pre Sales","Azure Data Factory","Python"],"Experience":[{"Title":"Cloud Architect","Company":"Cognizant","Location":"London","StartDate":"APRIL 2022","EndDate":"PRESENT","Description":"As a Cloud Architect (SME) my responsibilities are: Advised customers on various Cloud solution options, discussed benefits and risks of each, and recommended solutions aligned with their business needs. Collaborated with cross-functional teams to define cloud strategies, roadmaps, and migration plans. Design and implemented cloud-native solutions, microservices, serverless architectures, and containerized applications. Worked with application teams and architects to map out their migration roadmaps and target architectures. Modernizing and migrating application to Azure Cloud. Implemented and managed Azure services like AppService, LogicApps, FunctionApps, RedisCache, Key Vault, Service Bus, Site Recovery, Blob Storage, and more."},{"Title":"Cloud Migration Architect","Company":"Wipro","Location":"","StartDate":"OCTOBER 2018","EndDate":"JULY 2020","Description":"As an Cloud Migration Architect, my responsibilities were to understand the application architecture, Propose the To-Be architecture to migrate it to cloud (Azure Stack / IBM) based on the customer's requirement. Lead the design, planning and implementation of complex IT infrastructure solutions in Lloyds Banking Group account. Perform application portfolio analysis to prepare the check-list and identify candidate applications and workloads for migration to the Cloud. Create migration project plans, and execute against them. Develop pricing and cost models for complex engagements as part of the To-Be design. To design, develop, document, test, and debug new and existing configuration management (Terraform) infrastructure as code. Support CI/CD pipeline and identify potential problems. Leverage Azure DevOps and Jenkins subject matter expertise to support CI/CD environment."},{"Title":"Lead Software Engineer","Company":"Danske IT and Support Services India Private Limited","Location":"Bangalore, India","StartDate":"NOVEMBER 2016","EndDate":"SEPTEMBER 2018","Description":"As a Lead Engineer, my responsibility include: Technical requirement gathering and estimation. Direct Interaction with business and customers following agile methodology. Designed and Developed the application in C#.Net 3.5, ASP.Net, Classic ASP, Pl/SQL, WebAPI, Angular. Check In, Versioning control, for code review, creating a Work item, build management, Continuous integration using TFS. Whole responsibility to create a module to submit data to third party System (Danske Raadgiver)."},{"Title":"Software Engineer","Company":"Wells Fargo India Solutions Private Ltd.","Location":"Bangalore, India","StartDate":"DECEMBER 2013","EndDate":"OCTOBER 2016","Description":"Responsibilities include: Working as a .Net Developer to enhance functionality of Bank Intranet website. Responsible for debugging the bugs in the existing application and development of new modules. Developed a Maintenance Window (web application) using Asp.Net that enables the admin to maintain features (e.g. authentication, dB connection, modifying relationship between different parameters.) in the bank website. Developed various modules for Bank to enhance the process flow including automated mailing system, document archiving system etc. Developed a Request/Response System (ADA tool) that provides a User Friendly GUI(using .Net, AJAX, JQuery) to user and enables them to submit their request (Indexes/pointers) to store data in database in xml form."},{"Title":"Technical Analyst","Company":"Dell International Services India Private Ltd","Location":"Noida, India","StartDate":"APRIL 2011","EndDate":"OCTOBER 2013","Description":"Responsibilities include: Developed a Web Service (WCF) to expose the functionality of CORE module to other third party. Also Developed an alerting System (database alerts) using pl/SQL, MSMQ, C# that automatically alerts the support team for any error. Part of team that developed Authentication System for SHL application user (Window Service) that generates authentication token for users and passes it as an object to other interacting modules. Contributed in enhancement of RE Module in SHL (.Net 3.5 Platform). Developed tool for Data Extraction to cater regular demand of data extract from client. UI/front-end development, designed web pages using Ajax, Jscript, implement sitemap for primary/secondary page navigation, master pages."}],"Education":[{"Degree":"MBA","Institution":"Amity University","Location":"","StartDate":"","EndDate":"","GPA":null},{"Degree":"B.Tech","Institution":"Uttar Pradesh Technical University","Location":"Noida, India","StartDate":"APRIL 2007","EndDate":"MARCH 2011","GPA":null}],"Certifications":[{"Name":"Microsoft Certified: Azure Developer Associate","Issuer":"Microsoft","Date":""},{"Name":"AZ-300 Microsoft Azure Architect Technologies","Issuer":"Microsoft","Date":""},{"Name":"Microsoft Certified: Azure Security Engineer Associate","Issuer":"Microsoft","Date":""},{"Name":"AZ 900: Microsoft Certified Azure Fundamentals","Issuer":"Microsoft","Date":""},{"Name":"Professional Cloud Architect by Google","Issuer":"Google","Date":""}],"Projects":[]}